ITEST/itest.smoke/test-resources/simple_mul.xml.post.req

POST /simple HTTP/1.1
Content-Type: application/xml
Accept: application/xml;q=1.0, */*;q=0.1

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Body>
        <ns1:mul xmlns:ns1="http://DefaultNamespace">
            <ns1:x>7</ns1:x>
            <ns1:y>3</ns1:y>
        </ns1:mul>
    </soap:Body>
</soap:Envelope>